#  მოცემული 3 მთელი a, b, c ̸= 0 რიცხვებისთვის მოძებნეთ a და
# b რიცხვებს შორის მოხვედრილი c რიცხვის ჯერადი რიცხვების
# რაოდენობა ყველა შესაძლო ვარიანტისთვის. თუ რომელიმე
# a, b-დან ჯერადია c-ს, მაშინ ჩათვალეთ შესაბამისი საზღვარი.
# მოიფიქრეთ ამოცანის ამოხსნის ალგორითმი, დაწერეთ და გაუშვით პროგრამა ციკლის და რეკურსიის (აგრეთვე range) კონსტრუქციის გამოყენების გარეშე.


#არასწორია! 

def count_multiples(a,b,c):
    
    maximum_number = max(a,b)
    minimum_number = min(a,b)
    
    multiples_count = (minimum_number // c) - (maximum_number - 1) // c
    return multiples_count

print(count_multiples(10,30,3))